{"_id":{"$oid":"5d39420a9fe7ef61d0bf69f3"},"headline":"Rutger Hauer, ‘Blade Runner’ Co-Star, Dies at 75","summary":"Rutger Hauer, the versatile Dutch leading man of the ’70s who went on star in the 1982 “Blade Runner” as Roy Batty, died July 19 at his home in the Netherlands after a short illness. He was 75.Hauer’s agent, Steve Kenis, confirmed the news and said that Hauer’s funeral was held Wednesday.His most cherished performance came in a film that was a resounding flop on its original release. In 1982, he portrayed the murderous yet soulful Roy Batty, leader of a gang of outlaw replicants, opposite Harrison Ford in Ridley Scott’s sci-fi noir opus “Blade Runner.” The picture became a widely influential cult favorite, and Batty proved to be Hauer’s most indelible role.More recently, he appeared in a pair of 2005 films: as Cardinal Roark in “Sin City,” and as the corporate villain who Bruce Wayne discovers is running the Wayne Corp. in Christopher Nolan’s “Batman Begins.","image":"https://m.media-amazon.com/images/M/MV5BOTY4MjI0MjgyOV5BMl5BanBnXkFtZTgwMDA0MDkyODE@._V1_SY150_CR1,0,100,150_AL_.jpg","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5d39420b9fe7ef61d0bf69f5"},"headline":"‘Ameri-Scares’: Margot Robbie & Assemble Media Developing Family Horror Anthology","summary":"Margot Robbie and her LuckyChap Entertainment are teaming with Assemble Media and Warner Horizon to develop Elizabeth Massie’s Ameri-Scares book series as a family-friendly horror anthology with a road-trip spirit: Every episode would take place in a different state and center on a notorious local legends or spooky historical events.Ameri-Scares is being developed as a series for traditional television or for a streaming service. Robbie, Brett Hedblom, & Josey McNamara will produce for LuckyChap Entertainment, which produced the I, Tonya and the recently wrapped Birds of Prey (and The Fantabulous Emancipation of One Harley Quinn). Jack Heller & Brendan Deneen will produce for Assemble Media, which is also producing Gia Coppola’s forthcoming film Mainstream, starring Andrew Garfield, Maya Hawke, and Nat Wolff.“With Ameri-Scares we saw the perfect opportunity for us to delve into the horror space, and tell the kind of unique and scary stories we used to","image":"https://m.media-amazon.com/images/M/MV5BMjE0MjAwMjY2MV5BMl5BanBnXkFtZTgwMDAzOTU5NDM@._V1_SX100_CR0,0,100,150_AL_.jpg","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5d39420b9fe7ef61d0bf69f4"},"headline":"Jennifer Lawrence to Star in Paolo Sorrentino’s ‘Mob Girl’","summary":"Jennifer Lawrence is set to star in Makeready’s adaptation of the Pulitzer Prize-winning Teresa Carpenter true-crime story “Mob Girl.”Lawrence will also produce the film, which is based on the life of the mob wife turned police informant Arlyne Brickman, alongside Justine Polsky via their production company, Excellent Cadaver. Academy Award winner Paolo Sorrentino has been tapped to direct the adaptation with Angelina Burnett adapting the script. Sorrentino will also produce the project alongside Wildside’s Lorenzo Mieli.Makeready partner and head of film, Pamela Abdy and Natalie Williams will oversee for the studio.The film follows Brickman who grows up among racketeers on the Lower East Side of New York City where she’s drawn to the glamorous and flashy lifestyle of New York mobsters. Soon after, she begins dating “wiseguys” and running errands for them, before getting in on the action herself — eventually becoming a police informant","image":"https://m.media-amazon.com/images/M/MV5BOTU3NDE5MDQ4MV5BMl5BanBnXkFtZTgwMzE5ODQ3MDI@._V1_SX100_CR0,0,100,150_AL_.jpg","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5d39420c9fe7ef61d0bf69f6"},"headline":"‘Silicon Valley’ to Return in October for Sixth and Final Season","summary":"The sixth and final season of “Silicon Valley” is returning in October, HBO announced Wednesday. An official premiere date has yet to be set.A collaboration between showrunners Mike Judge and Alec Berg, the final season will consist of seven episodes. The series takes a comedic look at the modern-day epicenter of the high-tech gold rush, where the people most qualified to succeed are the least capable of handling success.HBO announced in May that the sixth season of “Silicon Valley” would be its last.“‘Silicon Valley’ has been a career and life highlight for us. We’ll miss it desperately, but we’ve always let Pied Piper’s journey guide the way, and Season 6 seems to be the fitting conclusion,” Judge and Berg said at the time. “We are forever indebted to our incredible cast, crew, and partners at HBO. At a certain point, there’s only so much","image":"https://m.media-amazon.com/images/M/MV5BMTAxNTEyODE5MTNeQTJeQWpwZ15BbWU4MDE3MjM3ODQz._V1_SY150_CR0,0,100,150_AL_.jpg","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5d39420d9fe7ef61d0bf69fa"},"headline":"Iranian director Mohammad Rasoulof sentenced to one year in prison","summary":"Filmmaker has been unable to leave Iran since having his passport confiscated in 2017.Iranian director Mohammad Rasoulof, whose credits include the 2017 Cannes Un Certain Regard award-winning A Man Of Integrity, has been sentenced to one year in prison by the Iranian Revolutionary Court, according to multiple reports.The Hamburg Film Festival, who has hosted the filmmaker several times, released a statement today (July 24) saying the conviction was handed down on Saturday (July 20). Rasoulof has been accused of “endangering national security” and “propaganda against the Islamic government”.The filmmaker is also not allowed to leave Iran for two years and has","image":"https://m.media-amazon.com/images/M/MV5BMjAyMjMzOTY3NF5BMl5BanBnXkFtZTgwNjgyNzQzMjE@._V1_SY150_CR10,0,100,150_AL_.jpg","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5d39420c9fe7ef61d0bf69f8"},"headline":"George Miller Updates Status Of Multiple ‘Fury Road’ Sequels & Is “Cautiously Optimistic” His Tilda Swinton/Idris Elba Film Will Happen","summary":"George Miller might be 74-years-old, but he very well might be more popular now than ever before. The filmmaker behind the ‘Mad Max’ franchise seems to have struck a chord culturally with ‘Fury Road,’ the 2015 film that many feel might be the very best action film of all time. And so, even though by this age, many folks are retiring and relaxing, Miller is busier than ever before, with multiple ‘Mad Max’ projects in the works, as well as a film with Tilda Swinton attached.Continue reading George Miller Updates Status Of Multiple ‘Fury Road’ Sequels & Is “Cautiously Optimistic” His Tilda Swinton/Idris Elba Film Will Happen at The Playlist.","image":"https://m.media-amazon.com/images/M/MV5BN2EwM2I5OWMtMGQyMi00Zjg1LWJkNTctZTdjYTA4OGUwZjMyXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_SY150_CR0,0,100,150_AL_.jpg","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5d39420c9fe7ef61d0bf69f7"},"headline":"Amazon Scraps Traditional Release for 'The Aeronauts,' Jeopardizing Imax Run","summary":"Amazon Studios' awards hopeful The Aeronauts, starring Felicity Jones and Eddie Redmayne, won't get a traditional theatrical release after all as the streamer increasingly begins to make some of its original films almost immediately available to customers, akin to Netflix.The 1862 period adventure, about two hot air balloonists and their perilous journey, was set to open exclusively in Imax theaters Oct. 25 before expanding nationwide Nov. 1. Now, The Aeronauts will now only debut in a select number of theaters Dec. 6 before premiering two weeks later on Amazon Prime.The change-up by Amazon Studios chief Jennifer Salke ...","image":"https://m.media-amazon.com/images/M/MV5BODU5Mjk4OTE2OV5BMl5BanBnXkFtZTgwMzE4ODIxNjM@._V1_SY150_CR83,0,100,150_AL_.jpg","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5d39420d9fe7ef61d0bf69f9"},"headline":"‘Younger’ Renewed For Season 7 By TV Land","summary":"Darren Star’s Younger will keep going on TV Land. The Viacom network has picked up a seventh season of the hit comedy series halfway through its Season 6 run. With the renewal, Younger becomes TV Land’s longest running original series, surpassing Hot In Cleveland, and one of the longest-running cable sitcoms.Younger’s sixth season, which debuted June 12, logged the series’ highest-rated season premiere in People 25-54 and Women 25-54 demos. It was also up +23% year-to-year among total viewers, drawing 1.3 million viewers.Coming off a fifth season that ranked as its highest-rated ever among adults 18-49, Younger remains the top cable sitcom for the third year in a row among W25-54 and W18-49.“Season after season, Younger has continued to reach new heights and build an incredibly loyal fan base,” said Keith Cox, President, Development and Production, Paramount Network and TV Land. “We love this talented and","image":"https://m.media-amazon.com/images/M/MV5BMTQ5OTIyMzkzOF5BMl5BanBnXkFtZTgwMDMzOTUxMDI@._V1_SX100_CR0,0,100,150_AL_.jpg","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5d39420d9fe7ef61d0bf69fb"},"headline":"Michael Moore and Trump Agree Democrats Blew It With Mueller Testimony (but Still Hate Each Other)","summary":"Robert Mueller’s congressional testimony on Wednesday morning divided Americans sharply along political lines, but it also brought bitter political enemies Michael Moore and Donald Trump together in agreement — briefly, anyway.It started Wednesday morning, after Moore tweeted a harsh assessment of Mueller’s competence, plus a bitter criticism of Democrats. “A frail old man, unable to remember things, stumbling, refusing to answer basic questions,” Moore said about Mueller. “I said it in 2017 and Mueller confirmed it today — All you pundits and moderates and lame Dems who told the public to put their faith in the esteemed Robert Mueller — just Stfu from now on.”Several hours later, Trump quote-tweeted Moore, and added “Even Michael Moore agrees that the Dems and Mueller blew it!”Also Read: Robert Mueller Hearings: 9 Breakout Moments, From 'Collusion' Confusion to the 'New Normal'Moore later replied to say that he agrees with Trump — though Trump shouldn","image":"https://m.media-amazon.com/images/M/MV5BYWJmZmE1YWItYjBjYi00ODU4LTg2MDUtOTQyNWY2NjFlOGM5L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_SY150_CR1,0,100,150_AL_.jpg","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5d39420e9fe7ef61d0bf69fc"},"headline":"‘Full Frontal’ Cold Open: Samantha Bee Would ‘Pee in a Box’ for ‘Cats’ Role","summary":"Samantha Bee is all about authenticity when it comes to portraying a character in Cats, despite not being cast for any parts in the forthcoming film. “I’ll pee in a box. I will barf on your wooden kitchen spoons,” she says in a clip from Wednesday’s Full Frontal cold open. “I only seem to remember my name 40 percent of the time.”In the clip, Bee says she was surprised seeing the trailer because she had auditioned, and apparently did not get a part. But, as she hilariously demonstrates","image":"https://m.media-amazon.com/images/M/MV5BMjU1Nzc1MjYzMF5BMl5BanBnXkFtZTcwNTQzMDExOA@@._V1_SY150_CR3,0,100,150_AL_.jpg","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5d39420e9fe7ef61d0bf6a00"},"headline":"‘Watchmen’ Boss Damon Lindelof Talks ‘Channeling the Spirit of Alan Moore’ in HBO Series","summary":"Damon Lindelof is taking a very Alan Moore approach to his series adaptation of Moore’s graphic novel “Watchmen.”Speaking at the Television Critics Association summer press tour on Wednesday, Lindelof said that Moore has a “punk rock spirit” and that if someone had told him that he was not allowed to do something in his own writing, Moore would have said “F— you, I’m doing it anyway.”So when it came to remaining completely faithful to Moore’s work versus taking risks with new story elements, Lindelof said, “I’m channeling the spirit of Alan Moore to say “F— you,","image":"https://m.media-amazon.com/images/M/MV5BMjE5MzcyMTU5OF5BMl5BanBnXkFtZTcwMTE5NDc1NQ@@._V1_SY150_CR2,0,100,150_AL_.jpg","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5d39420e9fe7ef61d0bf69fe"},"headline":"Damon Lindelof Is Open to ‘Watchmen’ Film Cast Appearing in His HBO Adaptation – But in Different Roles","summary":"Although Zack Snyder’s 2009 film adaptation of “Watchmen” has no connection to Damon Lindelof’s upcoming TV version for HBO, that doesn’t mean those actors are off-limits.Snyder’s film, which is more of a straight re-telling of Alan Moore’s acclaimed work, features a cast that includes Patrick Wilson, Malin Akerman, Jeffrey Dean Morgan, Carla Gugino, Billy Crudup and Jackie Earl Haley. Lindelof, who is spearheading the upcoming adaptation for HBO, told TheWrap that he’s open to casting them, just in different roles.“Maybe. Again, I don’t want to be cutesy about it. Our ‘Watchmen,’ with two notable exceptions, is trying to introduce new characters as opposed to dwelling on characters from the classic. But never say never.” Those two exceptions: Jeremy Irons portrays an older version of Ozymandias/Adrien Veidt (played by Goode in the film) and Doctor Manhattan (Crudup) appears to be a factor.","image":"https://m.media-amazon.com/images/M/MV5BMTMzMjUyNjk1MV5BMl5BanBnXkFtZTcwMDc2Mzk3NA@@._V1_SY150_CR6,0,100,150_AL_.jpg","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5d39420e9fe7ef61d0bf6a03"},"headline":"Film Review: ‘Girls With Balls’","summary":"Festival midnight slates are always teeming with Z-grade splatter comedies like “Girls with Balls,” which offer the uncomplicated pleasure of attractive young people fighting for their lives in the great outdoors. But first-time director Olivier Afonso, a skilled makeup-effects artist on such films as “Raw” and “The Diving Bell and the Butterfly,” could have complicated his hillbillies-versus-athletes scenario a little more than he has. Is there a scene where members of a women’s volleyball team spike balls into the faces of their adversaries? Of course. Yet that’s about as far as the conceit takes this chaotic, toothless, unfunny Gallic twist on “The Most Dangerous Game,” and it’s not even enough to reach 80 minutes. Netflix has served it up for less discriminate genre fans, however, who are advised to bypass the default dubbed version and watch it in French with subtitles.The extreme French horror movement of the","image":"https://m.media-amazon.com/images/M/MV5BYTU5OTM0NDktNjRjZC00Y2Q2LTk4NmItYWNkZmE1YmUyNGU0XkEyXkFqcGdeQXVyMTIwMzIxNDg@._V1_SY150_CR5,0,100,150_AL_.jpg","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5d39420e9fe7ef61d0bf6a04"},"headline":"‘Watchmen': Damon Lindelof Expects a Divisive Reaction to His Take on Acclaimed Comic","summary":"Fans of the Alan Moore’s “Watchmen” comic might have a hard time recognizing Damon Lindelof’s version that will debut on HBO in October. But according to Lindelof, that is the point.“Whether or not the show feels like it’s ‘Watchmen’ is in the eye of the beholder,” he said Wednesday during the show’s panel at the Television Critics Association press tour. “Some people who have an intense relationship with the source material might say, ‘This feels like ‘Watchmen’ to me,’ [while] others might say, ‘This is an aberration and I wish it never existed.'”Not much is known about HBO’s take on the famed comic series, except that it will not be a straight retelling of the 12-issue graphic novel series, but rather something new that takes place roughly 30 years later. “It’s canon,” he said. “Everything that happened in those 12 issues could not be messed with.","image":"https://m.media-amazon.com/images/M/MV5BZGRhNmE0NWMtNzBkNS00MDEzLWIxNjMtNWYwYzMyMWFmMGIyXkEyXkFqcGdeQXVyMTExNDQ2MTI@._V1_SY150_CR21,0,100,150_AL_.jpg","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5d39420e9fe7ef61d0bf6a05"},"headline":"Film Review: ‘Astronaut’","summary":"The recently widowed retiree Angus (Richard Dreyfuss) might be in the gutter, but he looks at the stars. Indeed, despite his flailing health and tricky family situation, the hopeful septuagenarian lives by that famous Oscar Wilde quote in “Astronaut,” actress-turned-filmmaker Shelagh McLeod’s caringly observed debut feature. It’s a modestly scoped, visually amateurish film, but limited resources don’t stop McLeod from reaching for galactic emotions with the story of a fantasist chasing his lifelong dream of becoming an astronaut. In the end, only a fraction of McLeod’s ambitions sticks a landing. But “Astronaut” stays afloat with sweetness, thanks to a measured performance from Dreyfuss.And that might just be intriguing enough for Dreyfuss loyalists, as well as aging viewers starved for original stories centered on their own demographics — after all, it’s not only the below-60 crowd that deserves to have an outer space adventure. But even","image":"https://m.media-amazon.com/images/M/MV5BMTUzMjIzMjM2NV5BMl5BanBnXkFtZTcwNDAxMDY0Mg@@._V1_SY150_CR2,0,100,150_AL_.jpg","__v":{"$numberInt":"0"}}
{"_id":{"$oid":"5d39420e9fe7ef61d0bf6a06"},"headline":"‘Los Espookys’ Renewed for Season 2 at HBO","summary":"“Los Espookys” is coming back for more scares.HBO has renewed the comedy for a second season.The series is headlined by “Saturday Night Live” veteran Fred Armisen who serves as a writer and executive producer as well as playing the role of Tico. The half-hour series is set in a strange and dreamy version of present day Mexico City following a group of friends turning their love for horror into a peculiar business.Those friends, known as Los Espookys, are led by Bernardo Velasco stars as Renaldo. Cassandra Ciangherotti plays Ursula, a calm and collected dental assistant who provides","image":"https://m.media-amazon.com/images/M/MV5BMTNiY2ZmZDMtOTc4Ni00OGFhLThkYzItM2I2Zjc0Y2I1MzlmXkEyXkFqcGdeQXVyMjE3MTA1Mw@@._V1_SY150_CR0,0,100,150_AL_.jpg","__v":{"$numberInt":"0"}}
